In [2]:
import pandas as p

## series operations

In [3]:
pp=p.Series(data=['43',66.04,87,'78',435],index=['math','sci','phy','tel','eng'],dtype=str)
print(pp)

math       43
sci     66.04
phy        87
tel        78
eng       435
dtype: object

### sdid :seri,data,index,dtype

In [4]:
p.Series([43,4332,3254,324]) # defaultily takes 0,1,2....

0      43
1    4332
2    3254
3     324
dtype: int64

In [5]:
p.Series(index=[32,21,122,123],dtype=int)

32    NaN
21    NaN
122   NaN
123   NaN
dtype: float64

In [6]:
p.Series(data=[43,23,12,4354,45,32])

0      43
1      23
2      12
3    4354
4      45
5      32
dtype: int64

In [7]:
dic={'a':1,'b':2,'c':3,'d':4}
p.Series(dic)  #dictionary convertes into the series

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
p.Series(data=66,index=[1,2,3,4,5])

1    66
2    66
3    66
4    66
5    66
dtype: int64

In [9]:
print(pp,'this is the data')
print(pp[0],'pp0'),print(pp[3],'pp3')  # gives the data value only
pp[0:4],pp[[2,3]],pp[['math','tel']] # to access the values in multi ways

math       43
sci     66.04
phy        87
tel        78
eng       435
dtype: object this is the data
43 pp0
78 pp3

(math       43
 sci     66.04
 phy        87
 tel        78
 dtype: object,
 phy    87
 tel    78
 dtype: object,
 math    43
 tel     78
 dtype: object)

In [10]:
                                                        # Data Frames
a=p.DataFrame(data=[['blue','green',],['dskf','dk','dkf'],['dkf','dfw','dfj']],index=['sun','earth','plut'],columns=[43,433,32])
print(a)

        43     433   32
sun    blue  green  None
earth  dskf     dk   dkf
plut    dkf    dfw   dfj

In [11]:
a[43],a[433] # to access the values by columns

(sun      blue
 earth    dskf
 plut      dkf
 Name: 43, dtype: object,
 sun      green
 earth       dk
 plut       dfw
 Name: 433, dtype: object)

In [12]:
a[0:2] # prints the rows

        43     433   32
sun    blue  green  None
earth  dskf     dk   dkf

In [13]:
a[[32,43]] #multiple columns accessing

         32    43
sun    None  blue
earth   dkf  dskf
plut    dfj   dkf

## accessing by the index names , will print last one also

In [14]:
a['sun':] # accessing data by the rows # without using ':' gives the error

        43     433   32
sun    blue  green  None
earth  dskf     dk   dkf
plut    dkf    dfw   dfj

In [15]:
a['sun':'plut']

        43     433   32
sun    blue  green  None
earth  dskf     dk   dkf
plut    dkf    dfw   dfj

In [16]:
a[:'earth']

        43     433   32
sun    blue  green  None
earth  dskf     dk   dkf

## adding a new column to df

In [17]:
                                                                           # adding a columns into dataframe
a['89']=['yellow','skdf','dkfk']
a['43']=['orange','df','wedf']

In [18]:
a

         43    433    32      89      43
sun    blue  green  None  yellow  orange
earth  dskf     dk   dkf    skdf      df
plut    dkf    dfw   dfj    dkfk    wedf

## accessing by loc function

In [19]:
# all are will be in the ' ' only must in loc 
print(a.loc['earth']) # print of only one row data 
print(a.loc[['sun','plut']])# print of multiple rows data
print(a.loc[['sun','earth'],['89','43']])   #print of particular rows and columns data    
print(a.loc['sun'].loc['89'],'its only one')# loc usage only one value accessing by row and column name

43     dskf
433      dk
32      dkf
89     skdf
43       df
Name: earth, dtype: object
        43    433    32      89      43
sun   blue  green  None  yellow  orange
plut   dkf    dfw   dfj    dkfk    wedf
           89      43
sun    yellow  orange
earth    skdf      df
yellow its only one

In [20]:
a.reset_index() # to set index for a df for permenant inplace=True

   index    43    433    32      89      43
0    sun  blue  green  None  yellow  orange
1  earth  dskf     dk   dkf    skdf      df
2   plut   dkf    dfw   dfj    dkfk    wedf

In [21]:
a

         43    433    32      89      43
sun    blue  green  None  yellow  orange
earth  dskf     dk   dkf    skdf      df
plut    dkf    dfw   dfj    dkfk    wedf

In [22]:
a.set_index(43) #inplace=True

        433    32      89      43
43
blue  green  None  yellow  orange
dskf     dk   dkf    skdf      df
dkf     dfw   dfj    dkfk    wedf

In [23]:
a=['sun','moon','jupyter','sat','neptune']
b=[0,1,2,3,4]
c=list(zip(a,b))                                               # new format of df
print(c)

[('sun', 0), ('moon', 1), ('jupyter', 2), ('sat', 3), ('neptune', 4)]

In [24]:
d=p.MultiIndex.from_tuples(c)
d

MultiIndex([(    'sun', 0),
            (   'moon', 1),
            ('jupyter', 2),
            (    'sat', 3),
            ('neptune', 4)],
           )

In [25]:
print(a,d)
e=p.DataFrame(a,d,['planet name']) # a is index name d is above one data and last is column name
e

['sun', 'moon', 'jupyter', 'sat', 'neptune'] MultiIndex([(    'sun', 0),
            (   'moon', 1),
            ('jupyter', 2),
            (    'sat', 3),
            ('neptune', 4)],
           )

          planet name
sun     0         sun
moon    1        moon
jupyter 2     jupyter
sat     3         sat
neptune 4     neptune


## Good df with dictionary

In [26]:
import numpy as n                          # Inserting NULL values in a dataframe
aa={'SRH':['warner','williamson','bhuvi',n.nan],'RBC':['virat','ABd',n.nan,'chahal'],'MI':[n.nan,'Rohit','Pandya','Malinga']}
pi=p.DataFrame(aa)  # create a data frame by dictionary                                   
print(pi)
p.DataFrame(aa,index=["p1","p2","p3","p4"])                 # Data Frame by dictionary giving new index

          SRH     RBC       MI
0      warner   virat      NaN
1  williamson     ABd    Rohit
2       bhuvi     NaN   Pandya
3         NaN  chahal  Malinga

           SRH     RBC       MI
p1      warner   virat      NaN
p2  williamson     ABd    Rohit
p3       bhuvi     NaN   Pandya
p4         NaN  chahal  Malinga

## droping null

In [27]:
print(pi.isnull())
print(pi.dropna(),"??")  # print not null rows only
print(pi.dropna(axis=1))

     SRH    RBC     MI
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False
          SRH  RBC     MI
1  williamson  ABd  Rohit ??
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

### filling null values

In [28]:
pi.fillna(value='subbu')       # fill null values in a df with name 'subbu'

          SRH     RBC       MI
0      warner   virat    subbu
1  williamson     ABd    Rohit
2       bhuvi   subbu   Pandya
3       subbu  chahal  Malinga

 # to fill only one clmn null values

In [29]:
pi['MI'].fillna(value='sundar')

0     sundar
1      Rohit
2     Pandya
3    Malinga
Name: MI, dtype: object

In [30]:
print(pi['MI'].fillna(value='sundar',inplace=True))# inplace makes true check next one subbu not appearing

None

In [31]:
pi

          SRH     RBC       MI
0      warner   virat   sundar
1  williamson     ABd    Rohit
2       bhuvi     NaN   Pandya
3         NaN  chahal  Malinga

In [32]:
pi['SRH']

0        warner
1    williamson
2         bhuvi
3           NaN
Name: SRH, dtype: object

In [33]:
pi[0:]

          SRH     RBC       MI
0      warner   virat   sundar
1  williamson     ABd    Rohit
2       bhuvi     NaN   Pandya
3         NaN  chahal  Malinga

#### like a list value accessing

In [34]:
pi[1:4:2]

          SRH     RBC       MI
1  williamson     ABd    Rohit
3         NaN  chahal  Malinga

### advanced index

In [35]:
pi.loc[[0,3,2],['SRH','MI','RBC']] #here index default so no need to use '' in 0 3 2       ADVANCED Indexing

      SRH       MI     RBC
0  warner   sundar   virat
3     NaN  Malinga  chahal
2   bhuvi   Pandya     NaN

In [36]:
 #dfname.columnname.value_counts()

In [37]:
print(pi.dropna())
print(pi)# prints with out null values rows only

          SRH    RBC      MI
0      warner  virat  sundar
1  williamson    ABd   Rohit
          SRH     RBC       MI
0      warner   virat   sundar
1  williamson     ABd    Rohit
2       bhuvi     NaN   Pandya
3         NaN  chahal  Malinga

# permanent delete null rows and print not null df

In [38]:
pi.dropna(inplace=True)

In [39]:
pi.shape

(2, 3)

In [40]:
pi

          SRH    RBC      MI
0      warner  virat  sundar
1  williamson    ABd   Rohit

## df from array

In [41]:
a=[['subbu','sun','moon'],[32,45,65]]
ab=p.DataFrame(data=a)
ab

       0    1     2
0  subbu  sun  moon
1     32   45    65

In [42]:
import numpy as n
aa=n.array(a).T
aa

array([['subbu', '32'],
       ['sun', '45'],
       ['moon', '65']], dtype='<U11')

In [43]:
ab=p.DataFrame(data=aa)
ab

       0   1
0  subbu  32
1    sun  45
2   moon  65

In [44]:
a=p.DataFrame(data=[['blue','green',],['dskf','dk','dkf'],['dkf','dfw','dfj']],index=['sun','earth','plut'],columns=[43,433,32])
print(a)

        43     433   32
sun    blue  green  None
earth  dskf     dk   dkf
plut    dkf    dfw   dfj

# adding a new row and clmn to df

In [45]:
a[89]=['pink','yellow','dark']

In [46]:
a

        43     433   32      89
sun    blue  green  None    pink
earth  dskf     dk   dkf  yellow
plut    dkf    dfw   dfj    dark

In [47]:
a.append(p.Series(data=['dks','dskf','dfae','kdsk'],index=a.columns,name='mars'))

C:\Users\stanneeru\AppData\Local\Temp\ipykernel_3420\1508287664.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a.append(p.Series(data=['dks','dskf','dfae','kdsk'],index=a.columns,name='mars'))

        43     433   32      89
sun    blue  green  None    pink
earth  dskf     dk   dkf  yellow
plut    dkf    dfw   dfj    dark
mars    dks   dskf  dfae    kdsk

In [48]:

da=['dkf','akf','dsfw','klasl']
g=a.append(p.DataFrame([da],index=['venus'],columns=a.columns))
print(g)

        43     433   32      89
sun    blue  green  None    pink
earth  dskf     dk   dkf  yellow
plut    dkf    dfw   dfj    dark
venus   dkf    akf  dsfw   klasl

C:\Users\stanneeru\AppData\Local\Temp\ipykernel_3420\3385713140.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  g=a.append(p.DataFrame([da],index=['venus'],columns=a.columns))

# deleting a clmn n row

In [49]:
a.drop(columns=32,inplace=True) #inplc for the prmenant

In [50]:
a

        43     433     89
sun    blue  green    pink
earth  dskf     dk  yellow
plut    dkf    dfw    dark

In [51]:
a.drop('plut')  # deleting the rows

        43     433     89
sun    blue  green    pink
earth  dskf     dk  yellow

# access

In [52]:
a.loc['sun']

43      blue
433    green
89      pink
Name: sun, dtype: object

In [53]:
a.loc['sun',433]

'green'

In [54]:
a.loc[['sun','earth'],433]

sun      green
earth       dk
Name: 433, dtype: object

In [55]:
a.loc['earth',[89,43]]

89    yellow
43      dskf
Name: earth, dtype: object

## to access 0,1,2 like default index in list we use iloc

In [56]:
print(a)
print(a.iloc[0])
print(a.iloc[[0,2]]) # 0 and 2 rows are printing
print(a.iloc[0:3])

        43     433     89
sun    blue  green    pink
earth  dskf     dk  yellow
plut    dkf    dfw    dark
43      blue
433    green
89      pink
Name: sun, dtype: object
       43     433   89
sun   blue  green  pink
plut   dkf    dfw  dark
        43     433     89
sun    blue  green    pink
earth  dskf     dk  yellow
plut    dkf    dfw    dark

In [57]:
print(a.iloc[:,0:2],"full df")  # iloc used for accessing data by the index model only 
print(a.iloc[:,[0,2]])   ### iloc index accessing values here 0 indexed clmn is 43 and 2 indexed clmn is 89

        43     433
sun    blue  green
earth  dskf     dk
plut    dkf    dfw full df
         43      89
sun    blue    pink
earth  dskf  yellow
plut    dkf    dark

## adding a new cloumn to df by condition

In [58]:
import pandas as p
aa=p.DataFrame(data=[[33,43,24],[43,56,67],[34,56,8]],columns=['su','bb','u'],index=['ma','uj','d'])
aa

    su  bb   u
ma  33  43  24
uj  43  56  67
d   34  56   8

In [59]:
import numpy as n 
aa['new_clmn']=n.where(aa['u']>33,'superb','duper') #if aa[u]>33 print super else dupe 
aa

    su  bb   u new_clmn
ma  33  43  24    duper
uj  43  56  67   superb
d   34  56   8    duper

In [60]:
aa['main']=n.array(500)   
aa

    su  bb   u new_clmn  main
ma  33  43  24    duper   500
uj  43  56  67   superb   500
d   34  56   8    duper   500

In [61]:
def a(b):
    c=n.where( b>33,'eligible','not_eligible')               ## important
    return c
aa['mass']=a(aa['su'])
aa

    su  bb   u new_clmn  main          mass
ma  33  43  24    duper   500  not_eligible
uj  43  56  67   superb   500      eligible
d   34  56   8    duper   500      eligible

# converting a datetime clmn into a string type to do operations with it

In [62]:
# df['date_time']=pands.to_datetime(df['date_time'])

In [63]:
aa

    su  bb   u new_clmn  main          mass
ma  33  43  24    duper   500  not_eligible
uj  43  56  67   superb   500      eligible
d   34  56   8    duper   500      eligible